<?php

$strip = $_SERVER['REMOTE_ADDR'];

switch($strip) {
  case '10.38.0.209':  {$usr='Ветченинов А.В.'; break;}
  case '10.38.99.64':  {$usr='Найдина Евгения Сергеевна'; break;}
  case '10.38.2.31':   {$usr='Трифонова Ирина Михайловна'; break;}
  case '10.38.2.32':   {$usr='Фефелова Елена Ивановна'; break;}
  case '10.38.2.33':   {$usr='Золотухина Марина Григорьевна'; break;}
  case '10.38.2.44':   {$usr='Сахарова Елена Николаевна'; break;}
  case '10.38.2.45':   {$usr='Веденчук Наталья Владиславовна'; break;}
  case '10.38.2.47':   {$usr='Малык Марина Александровна'; break;}
  case '10.38.2.55':   {$usr='Иванова Наталья Александровна'; break;}
  case '10.38.2.67':   {$usr='Гах Светлана Александровна'; break;}
  case '10.38.2.71':   {$usr='Машкина Светлана Борисовна'; break;}
  case '10.38.3.84':   {$usr='Ткаченко Ольга Викторовна'; break;}
  case '10.38.3.90':   {$usr='Булава Надежда Ивановна'; break;}
  case '10.38.3.91':   {$usr='Комова Елена Юрьевна'; break;}
  case '10.38.3.99':   {$usr='Брежнева Любовь Михайловна'; break;}
  case '10.38.6.92':   {$usr='Симакова Эльвира Владимировна'; break;}
  case '10.38.6.77':   {$usr='Долгова Елизавета Игоревна'; break;}
  case '10.38.6.94':   {$usr='Лакутина Инна Николаевна'; break;}
  case '10.38.17.82':  {$usr='Герасименко Надежда Викторовна'; break;}
  case '10.38.18.86':  {$usr='Сергеева Олга Ивановна'; break;}
  case '10.38.19.10':  {$usr='Кушнарь Татьяна Александровна'; break;}
  case '10.38.21.88':  {$usr='Аброськина Елена Владимировна'; break;}
  case '10.38.21.91':  {$usr='Швецова Ольга Владимировна'; break;}
  case '10.38.40.170': {$usr='Полозова М.В.'; break;}
  case '10.38.40.238': {$usr='Моргач М.Ю.'; break;}
  case '10.38.40.203': {$usr='Ефимова Л.В.'; break;}
  case '10.38.40.132': {$usr='Гараева И.В.'; break;}
  case '10.38.40.188': {$usr='Зимина О.С.'; break;}
  case '10.38.40.137': {$usr='Протасова И.А.'; break;}
  case '10.38.40.158': {$usr='Чибисова Е.Н.'; break;}
  case '10.38.40.167': {$usr='Обухова В.Ю.'; break;}
  case '10.38.40.201': {$usr='Клименко А.С.'; break;}
  case '10.38.40.28':  {$usr='Шкурина Я.Е.'; break;}
  case '10.38.40.23':  {$usr='Серебренникова О.Н.'; break;}
  case '10.38.40.231': {$usr='Юдаева Т.Н.'; break;}
  case '10.38.40.41':  {$usr='Майданская Е.О.'; break;}
  case '10.38.4.120':  {$usr='Васюкевич Зинаида Николаевна'; break;}
  case '10.38.4.121':  {$usr='Игнатова Марина Алексеевна'; break;}
  case '10.38.4.46':   {$usr='Немировец Наталья Николаевна'; break;}
  case '10.38.16.81':  {$usr='Пасько Елена Георгиевна'; break;}
  case '10.38.4.24':   {$usr='Костерева Марина Николаевна'; break;}
  case '10.38.10.86':  {$usr='Коломейцева Оксана Ивановна'; break;}
  case '10.38.8.12':   {$usr='Цимбал Ирина Алексеевна'; break;}
  case '10.38.4.25':   {$usr='Михайлова Наталья Евгеньевна'; break;}
  case '10.38.4.104':  {$usr='Смурова Кристина Станиславовна'; break;}
  case '10.38.5.109':  {$usr='Столярова Наталья Адьевна'; break;}
  case '10.38.5.96':   {$usr='Ниваева Татьяна Владимировна'; break;}
  case '10.38.5.110':  {$usr='Филалеева Ольга Александровна'; break;}
  case '10.38.15.82':  {$usr='Можаева Галина Ивановна'; break;}
  case '10.38.5.36':   {$usr='Гуркина Светлана Владимировна'; break;}
  case '10.38.5.39':   {$usr='Мухина Светлана Евгеньевна'; break;}
  case '10.38.5.11':   {$usr='Дмитриенко Светлана Александровна'; break;}
  case '10.38.5.48':   {$usr='Маркина Татьяна Ивановна'; break;}
  case '10.38.5.24':   {$usr='Иванова Ирина Николаевна'; break;}
  case '10.38.14.90':  {$usr='Федорович Светлана Николаевна'; break;}
  case '10.38.7.87':   {$usr='Ирхина Татьяна Валерьевна'; break;}
  case '10.38.20.90':  {$usr='Ахневская Ирина Викторовна'; break;}
  case '10.38.0.112':  {$usr='Донцов Денис Александрович'; break;}
  default: {$usr='Гость'; break;}
}
echo $usr;


?>